DataProcessors/СервисныеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СервисныеОбработки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/БонусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусыКонтрагентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиВВалюте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
			<Comment>Взаиморасчеты с контрагентами в валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПерсоналом</Name>
			<Comment>Расчеты с персоналом</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВыработки</Name>
					<Comment>#7426</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументРасчетаВыработки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСПодотчетниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПодотчетниками</Name>
			<Comment>Расчеты с подотчетниками</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/МатериалыВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>МатериалыВЭксплуатации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыОперацийВводаОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОперацийВводаОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаСкладах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПодотчетниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СервисныеОбработки/Forms/ПометитьНаУдалениеВсеДокументы/Ext/Form/Module.bsl
&НаКлиенте
перем ИдентификаторЗадания Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НеУдалятьДокументыУстановкиЦен = Истина;
	НеУдалятьДокументыУстановкиСтоимостиВыработки = Истина; // №13931
	
	//++ #14380 от 11.08.2022
	ИмяМетода = Метаданные.РегламентныеЗадания.ОчисткаБазы.ИмяМетода;
	СписокФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	Для каждого элемент Из СписокФоновыхЗаданий Цикл
		Если элемент.ИмяМетода = ИмяМетода И элемент.Состояние=СостояниеФоновогоЗадания.Активно Тогда
			ИдентификаторФоновогоЗадания = элемент.УникальныйИдентификатор;
		КонецЕсли; 
	КонецЦикла; 
	//-- #14380 от 11.08.2022
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ИдентификаторФоновогоЗадания <>  Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		СтатусФоновогоЗадания = ПолучитьДанныеНаСервере();
		Если СтатусФоновогоЗадания.Активность Тогда
			ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 2, Ложь);
			Элементы.ПометитьВсеНаУдаление.Видимость = Ложь;
	   		Элементы.УдалитьНепосредственно.Видимость = Ложь;
			Если СтатусФоновогоЗадания.Режим = "пометка" Тогда
			    Элементы.ОстановитьПометитьВсеНаУдаление.Видимость = Истина;
			Иначе
				Элементы.ОстановитьУдалитьНепосредственно.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗапуститьФоновоеЗадание(УдалятьНепосредственно)
	ИмяМетода = Метаданные.РегламентныеЗадания.ОчисткаБазы.ИмяМетода;
	ПараметрыФоновогоЗадания = Новый Массив;
	ПараметрыФоновогоЗадания.Добавить(НеУдалятьДокументыУстановкиЦен);
	ПараметрыФоновогоЗадания.Добавить(НеУдалятьДокументыУстановкиСтоимостиВыработки);
	ПараметрыФоновогоЗадания.Добавить(УдалятьНепосредственно);
	Ключ = ?( УдалятьНепосредственно, "удаление", "пометка");
	Фон = ФоновыеЗадания.Выполнить(ИмяМетода, ПараметрыФоновогоЗадания , Ключ, "Обработка документов на удаление");
	ИдентификаторФоновогоЗадания = Фон.УникальныйИдентификатор;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания()
	СтатусФоновогоЗадания = ПолучитьДанныеНаСервере();
	Если СтатусФоновогоЗадания.Прогресс >= 0 Тогда // Если есть сообщение от фонового задания
		Если СтатусФоновогоЗадания.Активность Тогда
			ЭтаФорма.Элементы.ТекущийПроцесс.Заголовок = СтатусФоновогоЗадания.ТекущийПроцесс;
			ИндикаторСостоянияФоновогоЗадания=СтатусФоновогоЗадания.Прогресс;
			ЭтаФорма.Элементы.ПрогрессБар.Видимость = Истина;
			ЭтаФорма.Элементы.ТекущийПроцесс.Видимость = Истина;
		Иначе	
			Если СтатусФоновогоЗадания.ТекущийПроцесс <> "" Тогда
			    ЭтаФорма.Элементы.ТекущийПроцесс.Заголовок = СтатусФоновогоЗадания.ТекущийПроцесс;
			КонецЕсли;
			ИндикаторСостоянияФоновогоЗадания=СтатусФоновогоЗадания.Прогресс;
			ОтключитьОбработчикОжидания("ПроверитьВыполнениеЗадания");
			Элементы.ОстановитьПометитьВсеНаУдаление.Видимость = Ложь;
			Элементы.ОстановитьУдалитьНепосредственно.Видимость = Ложь;
			Элементы.ПометитьВсеНаУдаление.Видимость = Истина;
			Элементы.УдалитьНепосредственно.Видимость = Истина;
			ИдентификаторФоновогоЗадания =  Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеНаСервере()
	Статус = Новый Структура;
	Статус.Вставить("Активность", Истина);
	Статус.Вставить("Прогресс", -1); // -1 для определения что новых сообщений нет
	Статус.Вставить("ТекущийПроцесс", "");
	Статус.Вставить("Режим", "");
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания); 
	Статус.Режим = Задание.Ключ;
	СообщенияПользователю=Задание.ПолучитьСообщенияПользователю(Истина);
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Если СообщенияПользователю.ВГраница() > 0  Тогда 
			ПоследнееСообщение = СообщенияПользователю[СообщенияПользователю.ВГраница()].Текст;
			Индекс = СтрНайти(ПоследнееСообщение, "|");
			Если Индекс > 0 Тогда  
				Статус.ТекущийПроцесс=Лев(ПоследнееСообщение, Индекс-1);
				Статус.Прогресс = Число(Сред(ПоследнееСообщение, Индекс+1, 3));
				Статус.Активность=Истина;
			Иначе
				Сообщить(ПоследнееСообщение);
			КонецЕсли;
		КонецЕсли; 
	Иначе
		Статус.Прогресс = 100;
		Статус.Активность=Ложь;
	КонецЕсли;
	Возврат Статус;
КонецФункции
	


&НаКлиенте
Процедура ПометитьВсеНаУдаление(Команда)
	ФормаВвода = ПолучитьФорму("Обработка.СервисныеОбработки.Форма.ФормаВводаПароля" ,  , ЭтотОбъект);
    ФормаВвода.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайныйПароль = ГСЧ.СлучайноеЧисло(1000, 9999);
	ФормаВвода.Текст="Для исключения случайного запуска, при нажатии на кнопку ""Пометить все на удаление"" будет запрошен ""Пароль""." + Символы.ПС + Символы.ПС + "Введите: " + Строка(Формат(СлучайныйПароль,"ЧЦ=5; ЧГ=0"));
    
    Оповещение = Новый ОписаниеОповещения("ПослеВВодаПароля", ЭтотОбъект, ФормаВвода);
    ФормаВвода.ОписаниеОповещенияОЗакрытии = Оповещение;
    ФормаВвода.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВВодаПароля(Число, Параметры) Экспорт
    Если НЕ Параметры.Пароль = Неопределено Тогда
		Если Параметры.Пароль = СлучайныйПароль Тогда
			//++ #14380 от 11.08.2022
			ЗапуститьФоновоеЗадание(Ложь);
	        ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Ложь);
			Элементы.ПометитьВсеНаУдаление.Видимость = Ложь;
			Элементы.УдалитьНепосредственно.Видимость = Ложь;
			Элементы.ОстановитьПометитьВсеНаУдаление.Видимость = Истина;
			//-- #14380 от 11.08.2022
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНепосредственно(Команда)
	ФормаВвода = ПолучитьФорму("Обработка.СервисныеОбработки.Форма.ФормаВводаПароля" ,  , ЭтотОбъект);
    ФормаВвода.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайныйПароль = ГСЧ.СлучайноеЧисло(1000, 9999);
	ФормаВвода.Текст="Для исключения случайного запуска, при нажатии на кнопку ""Удалить непосредственно"" будет запрошен ""Пароль""." + Символы.ПС + Символы.ПС + "Введите: " + Строка(Формат(СлучайныйПароль,"ЧЦ=5; ЧГ=0"));
    Оповещение = Новый ОписаниеОповещения("ПослеВВодаПароляПриНепосредственномУдалении", ЭтотОбъект, ФормаВвода);
    ФормаВвода.ОписаниеОповещенияОЗакрытии = Оповещение;
    ФормаВвода.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВВодаПароляПриНепосредственномУдалении(Число, ДопПараметры) Экспорт
	Если НЕ ДопПараметры.Пароль = Неопределено И ДопПараметры.Пароль = СлучайныйПароль Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОкончательногоВопросаПриНепосредственномУдалении", ЭтаФорма);
		ТекстВопроса = "Вы действительно хотите произвести полное непосредственное удаление данных?
		|Операция необратима, все документы, задачи и бизнесс-процессы исчезнут полностью, без возможности восстановления!";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончательногоВопросаПриНепосредственномУдалении(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗапуститьФоновоеЗадание(Истина);
        ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Ложь);
		Элементы.ПометитьВсеНаУдаление.Видимость = Ложь;
		Элементы.УдалитьНепосредственно.Видимость = Ложь;
		Элементы.ОстановитьУдалитьНепосредственно.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОстатки(Команда)
	
	ДиалогВыбора = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = "Выберите каталог, для сохранения XML файла с остатками.";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Показать(новый ОписаниеОповещения("ПослеУказанияКаталогаПриВыгрузкеОстатков", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУказанияКаталогаПриВыгрузкеОстатков(ВыбранныйКаталог, ДопПараметры) Экспорт
	
	Если Не ТипЗнч(ВыбранныйКаталог) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйКаталог.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВводаДатыПриВыгрузкеОстатков", ЭтотОбъект, новый Структура("Каталог", ВыбранныйКаталог[0]));
	ПоказатьВводДаты(ОписаниеОповещения, ТекущаяДата(), "Введите дату, на которую будут выгружены остатки (на конец дня).", ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыПриВыгрузкеОстатков(Дата, ДопПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = СтрШаблон("%1.xml", Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm"));
	ПолноеИмяФайла = СтрШаблон("%1\%2", ДопПараметры.Каталог, ИмяФайла);
	
	АдресФайлаВоВременномХранилище = "";	
	ВыгрузитьОстаткиНаСервере(Дата, АдресФайлаВоВременномХранилище); //ДопПараметры.Каталог); 	
	
	// #15138 файл нужен на клиенте
	ДополнительныеПараметры = Новый Структура("ИмяФайла", ИмяФайла);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОстаткиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПолучаемыеФайлы = Новый Массив;
    ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, АдресФайлаВоВременномХранилище));
	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОстаткиЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
		   
	ПоказатьОповещениеПользователя("Выгрузка остатков завершена.", , СтрШаблон("Создан файл %1", ДополнительныеПараметры.ИмяФайла));
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьОстаткиНаСервере(Дата, АдресФайлаВоВременномХранилище)
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, "UTF-8"); //СтрШаблон("%1\%2.xml", ВыбранныйКаталог, Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd_HH-mm")), "UTF-8");
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ОстаткиXDTO = ФабрикаXDTO.Создать("ОстаткиПоРегистрам", "ОстаткиПоРегистрам");
	
	МассивЗапросов = новый Массив;
	
	ДобавитьТекстЗапроса(МассивЗапросов, "ТоварыНаСкладах", ТекстЗапросаТоварыНаСкладах());
	ДобавитьТекстЗапроса(МассивЗапросов, "БонусыКонтрагентов", ТекстЗапросаБонусыКонтрагентов());
	ДобавитьТекстЗапроса(МассивЗапросов, "ВзаиморасчетыСКонтрагентами", ТекстЗапросаВзаиморасчетыСКонтрагентами());
	//ДобавитьТекстЗапроса(МассивЗапросов, "ВзаиморасчетыСКонтрагентамиВВалюте", ТекстЗапросаВзаиморасчетыСКонтрагентамиВВалюте()); //#13511 убрано
	ДобавитьТекстЗапроса(МассивЗапросов, "РасчетыСПерсоналом", ТекстЗапросаРасчетыСПерсоналом());
	ДобавитьТекстЗапроса(МассивЗапросов, "РасчетыСПодотчетниками", ТекстЗапросаРасчетыСПодотчетниками());
	ДобавитьТекстЗапроса(МассивЗапросов, "МатериалыВЭксплуатации", ТекстЗапросаМатериалыВЭксплуатации());
	ДобавитьТекстЗапроса(МассивЗапросов, "ДенежныеСредства", ТекстЗапросаДенежныеСредства());
	
	Для Каждого ТекущийЗапрос Из МассивЗапросов Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = ТекущийЗапрос.ТекстЗапроса;
		Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
		
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		
		КолонкиСсылки = новый Массив;
		КолонкиОпределениеТипа = новый Массив;
		
		Для Каждого Колонка Из ТаблицаОстатков.Колонки Цикл
			
			Если Лев(НРег(Колонка.Имя), 7) = "ссылка_" Тогда
				КолонкиСсылки.Добавить(Колонка.Имя);
			КонецЕсли;
			
			Если Лев(НРег(Колонка.Имя), 15) = "типсправочника_" Тогда
				КолонкиОпределениеТипа.Добавить(Колонка.Имя);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из ТаблицаОстатков Цикл
			
			Остаток_Тип = ОстаткиXDTO.Свойства().Получить(ТекущийЗапрос.ИмяОстатков).Тип;
			Остаток_XDTO = ФабрикаXDTO.Создать(Остаток_Тип);
			
			ЗаполнитьЗначенияСвойств(Остаток_XDTO, ТекущаяСтрока);
			
			Для Каждого ИмяКолонки Из КолонкиСсылки Цикл
				
				Если ТекущаяСтрока[ИмяКолонки] = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Остаток_XDTO["ИД_" + Сред(ИмяКолонки, 8)] = Строка(ТекущаяСтрока[ИмяКолонки].УникальныйИдентификатор());
				
			КонецЦикла;
			
			ОстаткиXDTO[ТекущийЗапрос.ИмяОстатков].Добавить(Остаток_XDTO);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОстаткиXDTO, "ОстаткиПоРегистрам");
	ЗаписьXML.Закрыть();
	
	// #15138 для передачи на клиент
	Файл = Новый Файл(ИмяВременногоФайла);		
	Если Файл.Существует() Тогда			
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		УдалитьФайлы(ИмяВременногоФайла);			
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьТекстЗапроса(МассивЗапросов, ИмяОстатков, ТекстЗапроса)
	
	МассивЗапросов.Добавить(новый Структура("ИмяОстатков, ТекстЗапроса", ИмяОстатков, ТекстЗапроса));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаТоварыНаСкладах()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахостатки.Организация КАК ссылка_Организация,
	|	ТоварыНаСкладахостатки.Склад КАК ссылка_Склад,
	|	ТоварыНаСкладахостатки.Номенклатура КАК ссылка_Номенклатура,
	|	ТоварыНаСкладахостатки.ХарактеристикаНоменклатуры КАК ссылка_ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладахостатки.СерияНоменклатуры КАК ссылка_СерияНоменклатуры,
	|	ТоварыНаСкладахостатки.КоличествоОстаток КАК Количество,
	//++ #13511
	|	ТоварыНаСкладахостатки.Номенклатура.БазоваяЕдиницаИзмерения КАК ссылка_ЕдиницаИзмерения,
	|	1 КАК Коэффициент,
	|	ВалютаУчета.Значение КАК ссылка_Валюта,
	//|	ТоварыНаСкладахостатки.СуммаВалОстаток КАК СуммаВал,
	//-- #13511
	|	ТоварыНаСкладахостатки.СуммаОстаток КАК Сумма	
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, ) КАК ТоварыНаСкладахостатки,
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|ГДЕ
	|	ТоварыНаСкладахостатки.КоличествоОстаток > 0
	|	И ТоварыНаСкладахостатки.СуммаОстаток > 0
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаБонусыКонтрагентов()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БонусыКонтрагентовОстатки.Контрагент КАК ссылка_Контрагент,
	|	БонусыКонтрагентовОстатки.ДисконтнаяКарта КАК ссылка_ДисконтнаяКарта,
	|	БонусыКонтрагентовОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.БонусыКонтрагентов.Остатки(&Дата, ) КАК БонусыКонтрагентовОстатки
	|ГДЕ
	|	БонусыКонтрагентовОстатки.СуммаОстаток > 0
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаВзаиморасчетыСКонтрагентами()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.Организация КАК ссылка_Организация,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК ссылка_Контрагент,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Договор КАК ссылка_Договор,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Сумма,
	|	ВалютаУчета.Значение КАК ссылка_Валюта
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&Дата, ) КАК ВзаиморасчетыСКонтрагентамиОстатки,
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток > 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаВзаиморасчетыСКонтрагентамиВВалюте()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиВВалютеОстатки.Организация КАК ссылка_Организация,
	|	ВзаиморасчетыСКонтрагентамиВВалютеОстатки.Контрагент КАК ссылка_Контрагент,
	|	ВзаиморасчетыСКонтрагентамиВВалютеОстатки.Договор КАК ссылка_Договор,
	|	ВзаиморасчетыСКонтрагентамиВВалютеОстатки.Валюта КАК ссылка_Валюта,
	|	ВзаиморасчетыСКонтрагентамиВВалютеОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиВВалюте.Остатки(&Дата, ) КАК ВзаиморасчетыСКонтрагентамиВВалютеОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиВВалютеОстатки.СуммаОстаток > 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаРасчетыСПерсоналом()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПерсоналомОстатки.Организация КАК ссылка_Организация,
	|	РасчетыСПерсоналомОстатки.Сотрудник КАК ссылка_Сотрудник,
	|	РасчетыСПерсоналомОстатки.СуммаОстаток КАК Сумма,
	|	ВалютаУчета.Значение КАК ссылка_Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Остатки(&Дата, ) КАК РасчетыСПерсоналомОстатки,
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|ГДЕ
	|	РасчетыСПерсоналомОстатки.СуммаОстаток > 0";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаРасчетыСПодотчетниками()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПодотчетникамиОстатки.Организация КАК ссылка_Организация,
	|	РасчетыСПодотчетникамиОстатки.Сотрудник КАК ссылка_Сотрудник,
	|	РасчетыСПодотчетникамиОстатки.СуммаОстаток КАК Сумма,
	|	ВалютаУчета.Значение КАК ссылка_Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками.Остатки(&Дата, ) КАК РасчетыСПодотчетникамиОстатки,
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|ГДЕ
	|	РасчетыСПодотчетникамиОстатки.СуммаОстаток > 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаМатериалыВЭксплуатации()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МатериалыВЭксплуатацииОстатки.Организация КАК ссылка_Организация,
	|	МатериалыВЭксплуатацииОстатки.Ответственный КАК ссылка_Ответственный,
	|	ВЫБОР
	|		КОГДА МатериалыВЭксплуатацииОстатки.Ответственный ССЫЛКА Справочник.ПроизводственныеБригады
	|			ТОГДА ""Кассы""
	|		КОГДА МатериалыВЭксплуатацииОстатки.Ответственный ССЫЛКА Справочник.Сотрудники
	|			ТОГДА ""Сотрудники""
	|		КОГДА МатериалыВЭксплуатацииОстатки.Ответственный ССЫЛКА Справочник.Бригады
	|			ТОГДА ""Бригады""
	|		КОГДА МатериалыВЭксплуатацииОстатки.Ответственный ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ""Контрагенты""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипСправочника_Ответственный,
	|	МатериалыВЭксплуатацииОстатки.Номенклатура КАК ссылка_Номенклатура,
	|	МатериалыВЭксплуатацииОстатки.ХарактеристикаНоменклатуры КАК ссылка_ХарактеристикаНоменклатуры,
	|	МатериалыВЭксплуатацииОстатки.СерияНоменклатуры КАК ссылка_СерияНоменклатуры,
	|	МатериалыВЭксплуатацииОстатки.КоличествоОстаток КАК Количество,
	|	МатериалыВЭксплуатацииОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.МатериалыВЭксплуатации.Остатки(&Дата, ) КАК МатериалыВЭксплуатацииОстатки
	|ГДЕ
	|	МатериалыВЭксплуатацииОстатки.КоличествоОстаток > 0
	|	И МатериалыВЭксплуатацииОстатки.СуммаОстаток > 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаДенежныеСредства()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваОстатки.Организация КАК ссылка_Организация,
	|	ДенежныеСредстваОстатки.СчетКасса КАК ссылка_СчетКасса,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваОстатки.СчетКасса ССЫЛКА Справочник.Кассы
	|			ТОГДА ""Кассы""
	|		КОГДА ДенежныеСредстваОстатки.СчетКасса ССЫЛКА Справочник.БанковскиеСчета
	|			ТОГДА ""БанковскиеСчета""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипСправочника_СчетКасса,
	|	ДенежныеСредстваОстатки.Валюта КАК ссылка_Валюта,
	|	ДенежныеСредстваОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&Дата, ) КАК ДенежныеСредстваОстатки
	|ГДЕ
	|	ДенежныеСредстваОстатки.СуммаОстаток > 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОстатки(Команда)
	
	ДиалогВыбора = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл XML с ранее выгруженными остатками.";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр = "Файл xml|*.xml"; //#13511
	ДиалогВыбора.Показать(новый ОписаниеОповещения("ПослеВыбораФайлаОстатков", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаОстатков(ВыбранныйФайл, ДопПараметры) Экспорт
	
	Если Не ТипЗнч(ВыбранныйФайл) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйФайл.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеВводаДатыПриЗагрузкеОстатков", ЭтотОбъект, новый Структура("ПутьКФайлу", ВыбранныйФайл[0]));
	ПоказатьВводДаты(ОписаниеОповещения, ТекущаяДата(), "Введите дату, на которую будут созданы документы ввода остатков (на конец дня).", ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыПриЗагрузкеОстатков(Дата, ДопПараметры) Экспорт
	
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// #15138 файл - на клиенте
	//ЗагрузитьОстаткиНаСервере(Дата, ДопПараметры.ПутьКФайлу);	
	//ПоказатьОповещениеПользователя("Загрузка остатков завершена.");
	ДополнительныеПараметры = Новый Структура("Дата", Дата);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьОстаткиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
    НачатьПомещениеФайла(ОписаниеОповещения, , ДопПараметры.ПутьКФайлу, Ложь, УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОстаткиЗавершение(Знач Успешно, Адрес, Знач ВыбранноеИмяФайла, Знач ДополнительныеПараметры) Экспорт
	
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;

	ЗагрузитьОстаткиНаСервере(ДополнительныеПараметры.Дата, Адрес);	
	ПоказатьОповещениеПользователя("Загрузка остатков завершена.");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОстаткиНаСервере(Дата, АдресВХранилище) //ПутьКФайлу)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла(".xml");
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	
	ОстаткиXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФабрикаXDTO.Тип("ОстаткиПоРегистрам", "ОстаткиПоРегистрам"));
	
	// Соответствие названия полей и типов справочников для поиска
	СоответствиеПолей = новый Соответствие;
	СоответствиеПолей.Вставить("Номенклатура", 		"Номенклатура");
	СоответствиеПолей.Вставить("Организация", 		"Организации");
	СоответствиеПолей.Вставить("Склад", 			"Склады");
	СоответствиеПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикиНоменклатуры");
	СоответствиеПолей.Вставить("СерияНоменклатуры", "СерииНоменклатуры");
	СоответствиеПолей.Вставить("ЕдиницаИзмерения", 	"КлассификаторЕдиницИзмерения");
	СоответствиеПолей.Вставить("Контрагент", 		"Контрагенты");
	СоответствиеПолей.Вставить("ДисконтнаяКарта", 	"ДисконтныеКарты");
	СоответствиеПолей.Вставить("Договор", 			"ДоговорыКонтрагентов");
	СоответствиеПолей.Вставить("Валюта", 			"Валюты");
	СоответствиеПолей.Вставить("Сотрудник", 		"Сотрудники");
	СоответствиеПолей.Вставить("Ответственный", 	"Сотрудники");
	СоответствиеПолей.Вставить("СчетКасса", 		"Кассы");
	
	//++ #13511 данные считываем в таблицу, затем сворачиваем и создаем документы
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ТипОстатков", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50)));
	ТаблицаДанных.Колонки.Добавить("ТипОперации", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыОперацийВводаОстатков"));
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДанных.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	
	ТаблицаДанных.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаДанных.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("ДисконтнаяКарта", Новый ОписаниеТипов("СправочникСсылка.ДисконтныеКарты"));
	ТаблицаДанных.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДанных.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанных.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаДанных.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	
	//СправочникСсылка.ПроизводственныеБригады, СправочникСсылка.Сотрудники, СправочникСсылка.Бригады, СправочникСсылка.Контрагенты
	МассивТиповОтветственный = Новый Массив;
	МассивТиповОтветственный.Добавить(Тип("СправочникСсылка.ПроизводственныеБригады"));
	МассивТиповОтветственный.Добавить(Тип("СправочникСсылка.Сотрудники"));
	МассивТиповОтветственный.Добавить(Тип("СправочникСсылка.Бригады"));
	МассивТиповОтветственный.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Ответственный", Новый ОписаниеТипов(МассивТиповОтветственный));
	
	МассивТиповСчетКасса = Новый Массив;
	МассивТиповСчетКасса.Добавить(Тип("СправочникСсылка.БанковскиеСчета"));
	МассивТиповСчетКасса.Добавить(Тип("СправочникСсылка.Кассы"));
	ТаблицаДанных.Колонки.Добавить("СчетКасса", Новый ОписаниеТипов(МассивТиповСчетКасса));
	
	ТаблицаДанных.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДанных.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДанных.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 4)));
	//-- #13511

	Для Каждого ТипОстатков Из ОстаткиXDTO.Свойства() Цикл
		
		// Ссылочные свойства + определение типа для составных
		СсылочныеСвойства = новый Массив;
		СвойстваОписаниеТипов = новый Массив;
		
		Для Каждого ТекущееСвойство Из ОстаткиXDTO.Свойства().Получить(ТипОстатков.Имя).Тип.Свойства Цикл
			
			Если Лев(НРег(ТекущееСвойство.Имя), 3) = "ид_" Тогда
				
				СсылочныеСвойства.Добавить(ТекущееСвойство.Имя);
				
			КонецЕсли;
			
			Если Лев(НРег(ТекущееСвойство.Имя), 15) = "типсправочника_" Тогда
				
				СвойстваОписаниеТипов.Добавить(ТекущееСвойство.Имя);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТипОперации = Перечисления.ТипыОперацийВводаОстатков[ТипОстатков.Имя];
 
		//Запрос = новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ВводОстатков.Ссылка
		//|ИЗ
		//|	Документ.ВводОстатков КАК ВводОстатков
		//|ГДЕ
		//|	ВводОстатков.Дата = &Дата
		//|	И ВводОстатков.ТипОперации = &ТипОперации
		//|";
		//Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
		//Запрос.УстановитьПараметр("ТипОперации", ТипОперации);
		//
		//Выборка = Запрос.Выполнить().Выбрать();
		//ЭтоНовый = Ложь;
		//
		//Если Выборка.Следующий() Тогда
		//	
		//	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		//	
		//Иначе
		//	
		//	ЭтоНовый = Истина;
		//	ДокументОбъект = Документы.ВводОстатков.СоздатьДокумент();
		//	ДокументОбъект.Заполнить(Неопределено);
		//	ДокументОбъект.Дата = КонецДня(Дата);
		//	
		//КонецЕсли;
		//
		//ДокументОбъект.Комментарий = "#Загружен обработкой ""Очистка базы""#";
		//ДокументОбъект.ТипОперации = ТипОперации;
		
		//ДокументОбъект[ТипОстатков.Имя].Очистить();
		
		Для Каждого ТекущаяСтрока Из ОстаткиXDTO[ТипОстатков.Имя] Цикл
			
			СтруктураСтроки = новый Структура;
			
			Для Каждого СсылочноеСвойство Из СсылочныеСвойства Цикл
				НайтиСсылку(СтруктураСтроки, ТекущаяСтрока, СсылочноеСвойство, СоответствиеПолей, СвойстваОписаниеТипов);
			КонецЦикла;
			
			//НоваяСтрока = ДокументОбъект[ТипОстатков.Имя].Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
			
			НоваяСтрокаДанных = ТаблицаДанных.Добавить();
			НоваяСтрокаДанных.ТипОперации = ТипОперации;
			НоваяСтрокаДанных.ТипОстатков = ТипОстатков.Имя;
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных, ТекущаяСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных, СтруктураСтроки);
			
		КонецЦикла;
		
		//Попытка
		//	ДокументОбъект.Записать();
		//Исключение
		//	Сообщить("Не удалось " + ?(ЭтоНовый, "создать", "обновить") + " документ по виду операции " + ТипОперации + ": " + ОписаниеОшибки());
		//	Продолжить;
		//КонецПопытки;
		
		//Попытка
		//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	Сообщить("Не удалось провести документ " + ДокументОбъект.Ссылка + ": " + ОписаниеОшибки());
		//КонецПопытки;
		
	КонецЦикла;
	
	ПоляИзмерений = "ТипОстатков, ТипОперации, Организация, Валюта, Склад";
	ТаблицаИзмерений = ТаблицаДанных.Скопировать(, ПоляИзмерений);
	ТаблицаИзмерений.Свернуть(ПоляИзмерений);
	Для каждого ИзмеренияДокумента из ТаблицаИзмерений Цикл
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводОстатков.Ссылка
		|ИЗ
		|	Документ.ВводОстатков КАК ВводОстатков
		|ГДЕ
		|	ВводОстатков.Дата = &Дата
		|	И ВводОстатков.ТипОперации = &ТипОперации
		|	И ВводОстатков.Организация = &Организация
		|	И ВводОстатков.Валюта = &Валюта
		|	И ВводОстатков.Склад = &Склад
		|";
		Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
		Запрос.УстановитьПараметр("ТипОперации", ИзмеренияДокумента.ТипОперации);
		Запрос.УстановитьПараметр("Организация", ИзмеренияДокумента.Организация);
		Запрос.УстановитьПараметр("Валюта", 	 ИзмеренияДокумента.Валюта);
		Запрос.УстановитьПараметр("Склад", 		 ИзмеренияДокумента.Склад);		
		
		Выборка = Запрос.Выполнить().Выбрать();
		ЭтоНовый = Ложь;
		
		Если Выборка.Следующий() Тогда
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
		Иначе
			
			ЭтоНовый = Истина;
			ДокументОбъект = Документы.ВводОстатков.СоздатьДокумент();
			ДокументОбъект.Заполнить(Неопределено);
			ДокументОбъект.Дата = КонецДня(Дата);
			
		КонецЕсли;
		
		ДокументОбъект.Комментарий = "#Загружен обработкой ""Очистка базы""#";
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ИзмеренияДокумента);
		
		ДокументОбъект[ИзмеренияДокумента.ТипОстатков].Очистить();
		
		СтруктураОтбора = Новый Структура(ПоляИзмерений);
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, ИзмеренияДокумента);
		НайденныеСтроки = ТаблицаДанных.НайтиСтроки(СтруктураОтбора);
		
		// №13930 для операций "Товары на складах" и "Материалы в эксплуатации" добавлена колонка "Цена"
		ПересчитыватьЦену = (ДокументОбъект.ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ТоварыНаСкладах
				Или ДокументОбъект.ТипОперации = Перечисления.ТипыОперацийВводаОстатков.МатериалыВЭксплуатации);
		
		Для каждого ТекущаяСтрока из НайденныеСтроки Цикл
			
			НоваяСтрока = ДокументОбъект[ИзмеренияДокумента.ТипОстатков].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			//++ №13930
			Если ПересчитыватьЦену Тогда
				НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, НоваяСтрока.Сумма, НоваяСтрока.Сумма / НоваяСтрока.Количество);
			КонецЕсли;
			//-- №13930
			
		КонецЦикла;
		
		Попытка
			ДокументОбъект.Записать();
		Исключение
			Сообщить("Не удалось " + ?(ЭтоНовый, "создать", "обновить") + " документ по виду операции " + ТипОперации + ": " + ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести документ " + ДокументОбъект.Ссылка + ": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	
	Попытка
		УдалитьФайлы(ПутьКФайлу);
	Исключение
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка удаления временного файла  "+ ПутьКФайлу);
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиСсылку(СтруктураСтроки, СтрокаXML, ИмяСвойства, СоответствиеПолей, СвойстваОписаниеТипов)
	
	// ИмяСвойства, как приходит в XML - ИД_Номенклатура
	// ИмяРеквизита, поле в 1С - Номенклатура
	
	Значение = СтрокаXML[ИмяСвойства];
	
	// Преобразуем имя свойства к полю в 1С
	ИмяРеквизита = Сред(ИмяСвойства, 4);
	
	// Чтобы определить тип справочника для поиска элемента, используем два варианта:
	// 1. Для этого поля явно передали тип в структуре XML, т.к. он составной
	// 2. Для него задано соответствие в "СоответствиеПолей"
	
	// Пример: поле Контрагент - справочник Контрагенты
	Если СвойстваОписаниеТипов.Найти("ТипСправочника_" + ИмяРеквизита) = Неопределено Тогда
		ИмяСправочника = СоответствиеПолей.Получить(ИмяРеквизита);
	Иначе
		ИмяСправочника = СтрокаXML["ТипСправочника_" + ИмяРеквизита];
	КонецЕсли;
	
	// Если ГУИД пустой не ищем
	Если Значение = "00000000-0000-0000-0000-000000000000" Тогда
		Возврат;
	КонецЕсли;
	
	// Пытаемся найти по ГУИД, если не находим сообщаяем, если обязательное, то пропускаем эту строку
	НайденнаяСсылка = Справочники[ИмяСправочника].ПолучитьСсылку(новый УникальныйИдентификатор(Значение));
	Если НайденнаяСсылка.ПолучитьОбъект() = Неопределено Тогда
		
		Сообщить(СтрШаблон("Не найден элемент справочника ""%1"", с идентификатором: %2", ИмяСправочника, Значение));
		Возврат;
		
	КонецЕсли;
	
	// Формируем найденный элемент в структуру
	СтруктураСтроки.Вставить(ИмяРеквизита, НайденнаяСсылка);
	
КонецПроцедуры


//++ №14380
&НаКлиенте
Процедура ОстановитьУдалитьНепосредственно(Команда)
	ОтключитьОбработчикОжидания("ПроверитьВыполнениеЗадания");
	ЭтаФорма.Элементы.ПрогрессБар.Видимость = Ложь;
	ЭтаФорма.Элементы.ТекущийПроцесс.Видимость = Ложь;
	ОтключитьФоновоеЗадание();
	Элементы.ОстановитьУдалитьНепосредственно.Видимость = Ложь;
	Элементы.ПометитьВсеНаУдаление.Видимость = Истина;
	Элементы.УдалитьНепосредственно.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьПометитьВсеНаУдаление(Команда)
	ОтключитьОбработчикОжидания("ПроверитьВыполнениеЗадания");
	ЭтаФорма.Элементы.ПрогрессБар.Видимость = Ложь;
	ЭтаФорма.Элементы.ТекущийПроцесс.Видимость = Ложь;
	ОтключитьФоновоеЗадание();
	Элементы.ОстановитьПометитьВсеНаУдаление.Видимость = Ложь;
	Элементы.ПометитьВсеНаУдаление.Видимость = Истина;
	Элементы.УдалитьНепосредственно.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ОтключитьФоновоеЗадание()
	Если ИдентификаторФоновогоЗадания <>  Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		// ищем задание среди запущенных
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания); 
		// И отменяем
		Задание.Отменить();
	КонецЕсли;
    ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецПроцедуры
//-- №14380

//-- №6270
